# Используем официальный образ Node.js версии 20 (LTS) в качестве основы
FROM node:20

# Создаем и устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файлы с зависимостями проекта (package.json и package-lock.json)
COPY package*.json ./

# Устанавливаем все необходимые зависимости
RUN npm install

# Копируем весь остальной код проекта в рабочую директорию контейнера
COPY . .

# Указываем порт, который будет слушать наше приложение
EXPOSE 3000

# Команда для запуска приложения
CMD ["node", "index.js"]